<?php

use Illuminate\Database\Seeder;

class events extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('events')->insert([
            ['id' => '1', 'name' => 'ปีใหม่สากลชุมชนทุกเผ่า ชาวแม่ฮ่องสอน', 'short_des' => 'กิจกรรมนี้เป็นแค่เพียงตัวอย่างเท่านั้น ภาพจาก:unsplash.com', 'description' => 'ข้อมูลอ้างอิง เทศบาลเมืองแม่ฮ่องสอน : กิจกรรมการเฉลิมฉลองส่งท้ายปีเก่าต้อนรับปีใหม่ ในรูปแบบที่เป็นสากลของชนเผ่าด้วยความรู้สึกแห่งมิตรภาพความอบอุ่น บนพื้นฐานของความหลากหลายทางวัฒนธรรมและประเพณีความเชื่อของผู้คนในท้องถิ่น ภายในงานจัดให้มีการแสดงศิลปวัฒนธรรมของแต่ละชนเผ่าการจำหน่ายสินค้าของชนเผ่า เช่น กะเหรี่ยง ม้ง มูเซอ ลีซอ ไทใหญ่ ปะโอ ลัวะ และจีนยูนนาน', 'budget' => '200', 'count_day' => '2', 'day' => 'วันขึ้นปีใหม่', 'start' => '2019-12-31', 'end' => '2020-01-01', 'timestart' => '08:00:00', 'mobile' => '053-612-9823', 'email' => 'admin@admin.com', 'highlight' => 'จำหน่ายสินค้าของชนเผ่า,จุดพลุฉลองปีศักราชใหม่,ช่วงเช้าของปีใหม่จะมีการทำบุญตักบาตรข้าวสารอาหารแห้งพระสงฆ์จำนวน 99 รูป,ร่วมถวายสังฆทาน ทำบุญตักบาตร ข้าวสารอาหารแห้ง และปัจจัยตามจิตศรัทธา,การแสดงพลุดอกไม้ไฟ', 'hashtag' => '#Hashtag,ปีใหม่,เฉลิมฉลอง,ทำบุญ', 'picture' => '1.jpg', 'assign' => '1', 'created_at' => '2019-01-31 01:43:26', 'updated_at' => '2019-02-09 14:11:45'],
            ['id' => '2', 'name' => 'เทศกาลเคาท์ดาวน์เชียงใหม่', 'short_des' => 'กิจกรรมนี้เป็นแค่เพียงตัวอย่างเท่านั้น ภาพจาก:unsplash.com', 'description' => 'ข้อมูลอ้างอิง sawadee.co.th : เทศกาลเคาท์ดาวน์เชียงใหม่จัดขึ้นเป็นประจำทุกปี ณ บริเวณประตูท่าแพ ภายในงานมีการแสดงบนเวที การแสดงดนตรีร่วมสมัย การแสดงศิลปวัฒนธรรม การแสดงพลุ และดอกไม้ไฟ การนับถอยหลังส่งท้ายปีเก่าต้อนรับปีใหม่', 'budget' => '500', 'count_day' => '2', 'day' => 'วันขึ้นปีใหม่', 'start' => '2019-12-31', 'end' => '2020-01-01', 'timestart' => '18:00:00', 'mobile' => '000-000-0000', 'email' => 'admin@admin.com', 'highlight' => 'จุดพลุฉลองปีศักราชใหม่,การแสดงพลุดอกไม้ไฟ', 'hashtag' => '#Hashtag,ปีใหม่,เฉลิมฉลอง', 'picture' => '2.jpg', 'assign' => '1', 'created_at' => '2019-01-31 02:05:10', 'updated_at' => '2019-02-02 23:59:42'],
            ['id' => '3', 'name' => 'เทศกาลรับตะวันใหม่ก่อนใครในสยาม', 'short_des' => 'กิจกรรมนี้เป็นแค่เพียงตัวอย่างเท่านั้น ภาพจาก:unsplash.com', 'description' => 'ข้อมูลอ้างอิง sawadee.co.th : พิธีต่อแสงตะวัน ที่อุทยานแห่งชาติผาแต้ม (พิธีกรรมตามประเพณีเก่าแก่) ท่องเที่ยวเส้นทางพระอาทิตย์ขึ้นก่อนใครในประเทศไทย ในวันขึ้นปีใหม่ และพิธีบวชต้นไม้', 'budget' => '100', 'count_day' => '1', 'day' => 'วันขึ้นปีใหม่', 'start' => '2020-01-01', 'end' => '2020-01-01', 'timestart' => '05:00:00', 'mobile' => '000-000-0000', 'email' => 'admin@admin.com', 'highlight' => 'การแสดงพลุดอกไม้ไฟ,การแสดงศิลปวัฒนธรรม,การแสดงดนตรีร่วมสมัย,แสงแรกของปี,พิธีบวชต้นไม้', 'hashtag' => '#Hashtag,วันสิ้นปี,ปีใหม่,พระอาทิตย์', 'picture' => '3.jpg', 'assign' => '1', 'created_at' => '2019-01-31 02:14:02', 'updated_at' => '2019-02-03 00:00:44'],
        ]);
    }
}
