<?php

use Illuminate\Database\Seeder;

class locations extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('locations')->insert([
            ['id' => 1, 'place_name' => 'สวนสาธารณะหนองจองคำ', 'place_des' => 'หนองจองคำหนองจองคำ เป็นสวนสาธารณะตั้งอยู่ใจกลางเมือง เป็นหนองน้ำที่เกิดขึ้นเองตามธรรมชาติ มีน้ำตลอดปี เป็นสถานที่พักผ่อนหย่อนใจ ของชาวแม่ฮ่องสอน เป็นสถานที่ที่นิยมไปถ่ายรูปและชื่นชมทัศนียภาพของวัดจองคำ และวัดจองกลางในมุมกว้าง และใช้เป็นสถานที่จัดงานประเพณีที่สำคัญ ๆ ของจังหวัดด้วย   บริเวณใกล้หนองจองคำ มีถนนคนเดินให้นักท่องเที่ยวไว้จับจ่ายซื้อของที่ระลึก', 'district' => 'จองคำ', 'zipcode' => '58000', 'province' => 'แม่ฮ่องสอน', 'amphoe' => 'เมืองแม่ฮ่องสอน', 'road' => '-', 'more_address' => 'ที่อยู่ : แขวง/ตำบล จองคำ เขต/อำเภอ เมืองแม่ฮ่องสอน จังหวัดแม่ฮ่องสอน 58000', 'lat' => '19.298602006259102', 'lon' => '97.96793488396418', 'created_at' => '2019-01-31 01:43:26', 'updated_at' => '2019-01-31 01:43:26'],
            ['id' => 2, 'place_name' => 'ประตูท่าแพ', 'place_des' => 'ประตูท่าแพ หรือชื่อเดิม ประตูเชียงเรือก เป็นประตูทางทิศตะวันออก และเป็น 1 ใน 5 ประตูเมืองชั้นในของเวียงเชียงใหม่ ปัจจุบันเป็นประตูเมืองเพียงแห่งเดียวที่มีบานประตู...', 'district' => 'พระสิงห์', 'zipcode' => '50200', 'province' => 'เชียงใหม่', 'amphoe' => 'เมืองเชียงใหม่', 'road' => 'มูลเมือง', 'more_address' => 'ที่อยู่ : แขวง/ตำบล พระสิงห์ เขต/อำเภอ เมืองเชียงใหม่ จังหวัดเชียงใหม่ 502001', 'lat' => '18.787840000000074', 'lon' => '98.99323000000004', 'created_at' => '2019-01-31 02:05:12', 'updated_at' => '2019-02-01 03:34:52'],
            ['id' => 3, 'place_name' => 'ผาชะนะได', 'place_des' => 'ผาชะนะได เป็นภูเขาที่มีความสูงเหนือระดับน้ำทะเลปานกลางประมาณ 450 เมตร ส่วนของหน้าผาตั้งอยู่ทางด้านตะวันออกสุดของประเทศไทย เป็นจุดเริ่มต้นคำนวณเวลาพระอาทิตย์ขึ้น ตั้งอยู่ในป่าดงนาทาม ในเขตอุทยานแห่งชาติผาแต้ม เป็นจุดที่มองเห็นพระอาทิตย์ขึ้นเป็นจุดแรกของประเทศไทย', 'district' => 'โขงเจียม', 'zipcode' => '34220', 'province' => 'อุบลราชธานี', 'amphoe' => 'โขงเจียม', 'road' => '-', 'more_address' => 'ที่อยู่ : แขวง/ตำบล โขงเจียม เขต/อำเภอ โขงเจียม จังหวัดอุบลราชธานี 34220', 'lat' => '15.462370000000021', 'lon' => '105.57668000000007', 'created_at' => '2019-01-31 02:14:05', 'updated_at' => '2019-02-01 03:35:25'],
        ]);
    }
}
